/**
 *
 * 1块钱做到1个亿要多久
 *
 */
class Yikuaiqian {
    public static QUESTIONS = [
        {
            question: "1元钱问题",
            detail: [
                '你手里拿着1块钱，站在人来人往的大街上，心里却装着全世界',
                '从1块钱开始，你要突破自我，用两年的时间，试试自己能赚到多少钱',
                '那么，第一步该怎么办?',

            ],
            answers: [
                { answer: "买一包干脆面去小学门口卖给小学生",event: "1元问题1" },
                { answer: "买一块刀片去小巷子里抢劫中学生",event: "1元问题2" },
                { answer: "买个碗去闹市乞讨",event: "1元问题3" },
                { answer: "找朋友再借1块钱买张彩票",event: "1元问题4" }
            ],
            left_times: 1,
            require: function(p) { return 1; }
        },
        {
            question: "10元钱问题",
            detail: [
                '从1块钱到10块钱，已经翻了好几番了，你为自己的进步感到骄傲',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "买张八卦图，去路边给人算命",event: "10元问题1" },
                { answer: "买块抹布和小凳，去帮人擦鞋",event: "10元问题2" },
                { answer: "买一盒劣质避孕套，去小旅馆门口卖",event: "10元问题3" },
                { answer: "在黑市买张100元假币，去小卖部找老花眼爷爷换零钱",event: "10元问题4" }
            ],
            left_times: 1,
            require: function(p) {
                if(p.money <= 10) { return 1; }
                else { return 3; }
            },
        },
        {
            question: "100元钱问题",
            detail: [
                '把零钱换整后，你终于见到了红光闪闪的毛爷爷，',
                '那仿佛朝阳的颜色让你有了人生的新目标，',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "买瓶红药水浇在裤子上，去找车碰瓷",event: "100元问题1" },
                { answer: "进一批手机膜去地铁门口摆摊贴膜",event: "100元问题2" },
                { answer: "买几十张空白光盘去网吧刻爱情动作片，去路边叫卖",event: "100元问题3" },
                { answer: "买双丝袜和玩具枪去抢珠宝店",event: "100元问题4" }
            ],
            left_times: 1,
            require: function(p) {
                if(p.money <= 100) { return 1; }
                else { return 3; }
            },
        },
        {
            question: "1000元钱问题",
            detail: [
                '经过努力，你已经有了好多面光红润的毛爷爷',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "进一批袜子和女生饰品去天桥摆摊",event: "1000元问题1" },
                { answer: "收一个废油桶，去路边烤红薯卖",event: "1000元问题2" },
                { answer: "租一辆宝马去夜店门口骗财，顺便骗色",event: "1000元问题3" },
                { answer: "以兼职名义招一个女大学生去酒吧当酒托",event: "1000元问题4" }
            ],
            left_times: 1,
            require: function(properties) {
                if(properties.money <= 1000) { return 1; }
                else { return 3; }
            },
        },
        {
            question: "10000元钱问题",
            detail: [
                '揣着兜里的一沓钱，你心怀感动，',
                '当上CEO尽享人生的日子好像就在眼前',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "在学校周边租个小两居，改成日租房租给大学生",event: "10000元问题1" },
                { answer: "四处打听消息，得到进货渠道后去酒吧卖摇头丸",event: "10000元问题2" },
                { answer: "租个地下室，开个赌场抽水",event: "10000元问题3" },
                { answer: "去少林寺学烹饪，然后到餐馆当厨师",event: "10000元问题4" }
            ],
            left_times: 1,
            require: function(properties) {
                if(properties.money <= 10000) { return 1; }
                else { return 3; }
            },
        },
        {
            question: "10万问题",
            detail: [
                '深冬寒夜里，你默默关掉没暖气屋子内的电热毯',
                '省吃俭用加上不懈努力，你的资金已经有好几元了',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "租店铺，招人开个成都小吃",event: "10万问题1" },
                { answer: "租房，招几个小姐迎客，自己抽成",event: "10万问题2" },
                { answer: "养几个打手，专职帮人追债",event: "10万问题3" },
                { answer: "开个淘宝店卖情趣用品",event: "10万问题4" }
            ],
            left_times: 1,
            require: function(properties) {
                if(properties.money <= 100000 ) { return 1; }
                else { return 3; }
            },
        },
        {
            question: "50万问题",
            detail: [
                '“是时候做更重要的人生选择了”',
                '你吃完一碗盖饭，猛喝几口免费汤，继续思考人生',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "进入股市",event: "50万问题1" },
                { answer: "找一批农民工组建施工队，当包工头",event: "50万问题2" },
                { answer: "从境外走私一批名表名包到境内卖",event: "50万问题3" },
                { answer: "以“资产重组”为名组建新的传销组织",event: "50万问题4" }
            ],
            left_times: 1,
            require: function(properties) {
                if(properties.money <= 500000 && properties.money > 100000) { return 1; }
                else { return 3; }
            },
        },
        {
            question: "200万问题",
            detail: [
                '衣着光鲜的你看着落地窗外的车来人往',
                '“或许，该做点更大的生意了”',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "去缅甸进货，倒卖毒品",event: "200万问题1" },
                { answer: "注册一个P2P公司，拉到钱就跑路",event: "200万问题2" },
                { answer: "挖一批美女主播，搞色情聊天室",event: "200万问题3" },
                { answer: "谈好货源，去非洲卖拖拉机",event: "200万问题4" }
            ],
            left_times: 1,
            require: function(properties) {
                if(properties.money <= 2000000 && properties.money > 500000) { return 1; }
                else { return 3; }
            },
        },
        {
            question: "1000万问题",
            detail: [
                '你躺在180平米的大房子里的沙发上，轻轻摇晃红酒杯',
                '想起那天夕阳下你的梦想——让全世界瞩目',
                '接下来要怎么选择呢？',
            ],
            answers: [
                { answer: "招兵买马，开始互联网创业",event: "1000万问题1" },
                { answer: "南非走私一批钻石到国内卖",event: "1000万问题2" },
                { answer: "办个小学，自己当校长",event: "1000万问题3" },
                { answer: "投资期货市场",event: "1000万问题4" }
            ],
            left_times: 1,
            require: function(properties) {
                if(properties.money <= 2000000 && properties.money > 500000) { return 1; }
                else { return 3; }
            },
        },
    ];

    public static EVENTS = [ //选择背景状态
        {
            detail: [
                '你几乎是以强迫的态度逼着一位小学生买下了你那包快捏烂的方便面',
                '伴随着小学生的哭声，你拿着10块钱快速离开了现场',
                '“熊孩子果然可怕，面都拿到了还跟吃了亏似的…”',
                '你如此想着，不禁又摸了摸口袋里热乎的那10块钱',
            ],
            name: '1元问题1',properties: { money: 10, time: 1 },
            from: '*',to: ''
        },

        {
            detail: [
                '你拦下了一对看似早恋的中学生情侣，小男孩战战兢兢的拿出10块钱',
                '“这是我全部的钱了，你要什么都行，别伤害她”',
                '接过小男孩的钱，你离开时深深感慨：“原来真的有只值10块钱的爱情…”',
            ],
            name: '1元问题2',properties: { money: 10,time: 1 },
            from: '*',to: ''
        },

        {
            detail: [
                '你在闹市上各种低头哈腰',
                '好心的软妹子和装好心的大叔时不时往你碗里丢个几块钱',
                '一天下来，你高高兴兴收起满满一碗钱，收摊回家',
            ],
            name: '1元问题3',properties: { money: 10,time: 1 },
            from: '*',to: ''
        },

        {
            detail: [
                '你很努力的找到一个愿意见你的朋友',
                '“要中了500万，我绝对请你吃麻辣烫吃个够”，你信心满满的拍着胸脯说',
                '然而天不如人意，你和好朋友的关系仅止步于这1块钱',
                '最关键的是，你连你自己的那1块钱都打了水漂',
            ],
            name: '1元问题4',properties: { money: function(p) { return -p.money }, time: 1, __SHOW_ENDING: 1, ending: 10},
            from: '*',to: ''
        },

        {
            detail: [
                '天桥上不停的有各种肥头大耳的土豪和艳丽的少妇找你指点人生',
                '你看着他们的金链子，咽了咽口水，开始你的嘴皮子功夫表演',
                '目送他们的离开，你小心翼翼的把一张张钞票收好。',
                '就这样，过了好多天鬼话连篇的日子，',
                '天天磨嘴皮子，都快让你不会说人话了，你决定清点下积蓄，再干点别的什么事',
            ],
            name: '10元问题1',properties: { money: function(p) { return -p.money + 300 }, time: 3 },
            from: '*',to: ''
        },

        {
            detail: [
                '勤奋的你开始了擦鞋的生意',
                '还好除了城管，并没有什么人会找你麻烦',
                '直到有一天，你听到一位妈妈教育孩子：',
                '“你再不听话以后就只能和这个人一样在街头擦鞋！”',
                '你的内心深深刺痛，决定清点下积蓄，干些别的事情去',
            ],
            name: '10元问题2',properties: { money: function(p) { return -p.money + 500 }, time: 7 },
            from: '*',to: ''
        },

        {
            detail: [
                '你蹲在小旅馆的门口，YY着里面的翻云覆雨场面…',
                '避孕套在这里真的是个刚需，一晚上你来来回回跑了好几趟，卖出了几十盒套套',
                '你紧紧的攥着手中的钞票，你开始越来越佩服旅馆这种地方的抗震性能',
                '“如果有钱了，我也要给自己盖个旅馆，来地震都塌不了”',
            ],
            name: '10元问题3',properties: { money: function(p) { return -p.money + 200 }, time: 7 },
            from: '*',to: ''
        },

        {
            detail: [
                '你怀着揣测不安的心情走进一个小卖部',
                '老大爷和蔼可亲的样子甚至让你感到于心不忍',
                '你紧张的把那100元假钞递给眼花的大爷',
                '幸好，大爷什么异样都没发现，给你换了零钱。你拿了那些零钱，迅速的跑了出去',
            ],
            name: '10元问题4',properties: { money: function(p) { return -p.money + 80 }, time: 1 },
            from: '*',to: ''
        },

        {
            detail: [
                '你找准了一个不起眼的十字路口，确定这儿没有管闲事的交警和路人',
                '眼看着一辆大货车来了，“拉货的师傅，肯定有不少的货款带在身上。”你咬咬牙，冲了出去',
                '憨厚的货车师傅赶紧跑下来看看你的情况，你一口咬定是师傅的错，要求赔偿',
                '货车师傅只能怪自己没装行车记录仪，认了倒霉，乖乖的给你一沓钞票',
            ],
            name: '100元问题1',properties: { money: function(p) { return -p.money + 500 }, time: 1 },
            from: '*',to: ''
        },

        {
            detail: [
                '你抬着小板凳和折叠桌来到地铁口，立起了你的纸牌——“贴膜之神”',
                '“哎姑娘，你这是苹果手机，这必须得用最好的膜！这么着，给你个实在价，50块钱不能再低了！”',
                '你拿出你最好的膜，琢磨着为啥崇拜乔教主的人贴个膜都要这么高级，还得花你2块钱来进货',
                '要知道，一般的膜，几毛钱就能拿到货了…',
                '干了几天，生意一直不错，你仿佛感到了贴膜BOYS附体在你身上…',
            ],
            name: '100元问题2',properties: { money: function(p) { return -p.money + 800 }, time: 3 },
            from: '*',to: ''
        },

        {
            detail: [
                '面对着挑光盘大叔的猥琐神情，和羞涩小男孩颤抖的递钱动作',
                '你安慰自己说：“我是在为广大群众普及性文化教育！”',
                '虽然一直提心吊胆被城管蜀黍抓走，以传播低俗文化名义请你到局子里喝茶',
                '但还好，巷子深，酒也香，你的小生意做的还算安稳',
            ],
            name: '100元问题3',properties: { money: function(p) { return -p.money + 500 }, time: 7 },
            from: '*',to: ''
        },

        {
            detail: [
                '你很努力的看了几部犯罪片，学习抢劫的基本动作和知识',
                '蒙着丝袜的你来到珠宝店，把玩具枪掏出来，对着柜员大吼：“抢劫！把珠宝都给我拿出来！”',
                '然而就在你装珠宝的时候，一群保安已经到了你的身后，十几把霰弹枪对着你',
                '柜员冷冷的对你说：“你那台词太不专业了，就没说不让我们报警。”',
                '“他XX的，电影都是骗人的！”你被押上警车，只能不停的叹气…',
            ],
            name: '100元问题4',properties: { money: function(p) { return -p.money; },time: 1,__SHOW_ENDING: 10, ending: 20},
            from: '*',to: ''
        },

        {
            detail: [
                '找了个没有竞争对手的天桥，你开始了你的摆摊生意，',
                '几天过去，生意居然还不错，并且让你亲眼目睹了女人的消费能力以及砍价能力',
                '你感觉自己在成为女性之友的路上已经走得很远，连大白都要比不上你了',
                '小本生意虽然不怎么赚钱，你还是坚持为各路女生造福了好几个月',
            ],
            name: '1000元问题1',properties: { money: function(p) { return -p.money + 6000; }, time: 90 },
            from: '*',to: ''
        },

        {
            detail: [
                '烤红薯的生意其实是大有学问的',
                '刚入行几天，你就明白为什么同行都坚持要用那种很古老的杆秤了',
                '“短斤少两是盈利的王道！”一位做了很久的同行不断在炫耀他那挖了个洞的秤砣',
                '虽然这钱来的也不容易，但是你想到红薯带给客人们的温暖，也便坚持了小半年',
            ],
            name: '1000元问题2',properties: { money: function(p) { return -p.money + 18000; }, time: 180 },
            from: '*',to: ''
        },

        {
            detail: [
                '开着租来的宝马车，你连腰杆都挺直了不少',
                '你开始佩服夜店出来的形形色色的人，喝了那么多酒，人长成什么样都看不清了，居然还能看清车标',
                '你成功的钓到了一个喝到烂醉的凯子，坐着你的车去开房了',
                '第二天早上醒来，你发现那个人已经不见了，只剩下桌上留的一叠百元钞票，还有一张纸条',
                '“昨晚辛苦你了，你表现很好，这些钱留给你补补身体”',
            ],
            name: '1000元问题3',properties: { money: function(p) { return -p.money + 2000; }, time: 1 },
            from: '*',to: ''
        },

        {
            detail: [
                '“记住，一定要点很多的酒！还有，别把自己喝醉！”你如此教育着你招来的手下',
                '另一头，你已经在跟酒吧的服务员谈分成的事情了',
                '其实连你自己也很好奇，为啥酒吧的酒都死贵死贵的，还是没有人打12315投诉呢？',
                '经过几次成功利用男人的情欲心理，你和你的“女大学生”在几天就赚到了很多钱',
            ],
            name: '1000元问题4',properties: { money: function(p) { return -p.money + 9000; }, time: 30 },
            from: '*',to: ''
        },

        {
            detail: [
                '本着造福广大大学生的情侣的原则，你干起日租房的生意',
                '看着每天各式各样稚气的大学生情侣，你不禁感慨：',
                '“还是大学生好，几十块钱就能拥有爱情。以后，这样的爱情得要几百万的房子才能拥有。”',
                '当然，你还能见到同一个男生，经常带着不同的妹子来光顾你的日租房',
                '很会做生意的你总是十分主动：“老客户了啊，给您打个8折啊！”',
                '日租房的生意还算红火，几个月下来，你又开始琢磨更大的生意……',
            ],
            name: '10000元问题1',properties: { money: function(p) { return -p.money + 45000; }, time: 90 },
            from: '*',to: ''
        },

        {
            detail: [
                '“哥们，要不要来点刺激的东西？”',
                '你很努力的推销着你的产品，五颜六色的小药丸给了酒吧的男男女女各种欢乐',
                '当然难免会有阴沟里翻船的时候……',
                '你正向一位美女推销你的产品，没想到美女从包里掏出了一付手铐',
                '“对不起，我是卧底。”',
                '你全部资产投入的摇头丸都被没收，你也坐进了监牢……',
            ],
            name: '10000元问题2',properties: { money: function(p) { return -p.money; }, time: 7, __SHOW_ENDING: 30, ending: 30 },
            from: '*',to: ''
        },

        {
            detail: [
                '“来来来，买好离手了！” “八条胡了！”',
                '你的地下室赌场开业，风声立马传到了各路赌徒耳朵里',
                '你雇起保镖，开启会员推荐制，确保生意万无一失，小赌场开的风生水起。',
                '几个月后，你算了算自己收的油水钱，竟也是一笔不少的数目',
            ],
            name: '10000元问题3',properties: { money: function(p) { return -p.money + 90000; }, time: 90 },
            from: '*',to: ''
        },

        {
            detail: [
                '从少林寺学成归来，你以“食神再世”的称号，应聘去了某个大酒店当厨师',
                '然而你发现，这几十平米的大酒店真的就只有名字写着“大酒店”',
                '就连“食神再世”的你，也只有区区几千元的月薪',
                '干了几个月，你决定重新思考人生',
            ],
            name: '10000元问题4',properties: { money: function(p) { return -p.money + 10000; }, time: 180 },
            from: '*',to: ''
        },

        {
            detail: [
                '你开起了饭店生意，虽然不大，却也是个CEO了',
                '虽然每天来吃饭的顾客只会对你说“老板”，但你心里清楚，你是一位有理想有文化的人',
                '开小饭店的生活倒也安逸，除了碰上卫生局检查和吃霸王餐的顾客，基本没什么烦心事',
                '小半年过去，你也累积了不少钱',
            ],
            name: '10万问题1',properties: { money: function(p) { return -p.money + 180000; },time: 180 },
            from: '*',to: ''
        },

        {
            detail: [
                '你想起你那巧舌如簧的本事，于是忽悠来几位失足少女，开起了窑子',
                '“大哥，进来玩玩啊！”你很努力的揽着客，似乎揽的就是自己的梦想',
                '幸好你忽悠来的小姐们都很卖力，客人络绎不绝，给你的钱也越来越多，甚至还有额外给小费的',
                '还好扫黄打非行动这段时间没有开展，你的窑子生意做得有模有样。',
                '好景不长，几个月后，你收到风声最近要查黄。趁着还没被拘留，你赶紧关了店',
            ],
            name: '10万问题2',properties: { money: function(p) { return -p.money + 720000; }, time: 90 },
            from: '*',to: ''
        },

        {
            detail: [
                '你看了那些黑帮片，很是羡慕那些大佬风光收债的样子',
                '你拿着存下的钱雇了几位小混混，成立了讨债公司',
                '通过贴小广告和口碑传播，你开始有了几单生意',
                '敬酒罚酒软的硬的手段你玩的风生水起，讨回了好几单大手笔，更是收了不少劳务费',
                '不过久了之后，你也累了，想起小柯的那句“我不做大哥好多年…”。你决定重新再规划下一步',
            ],
            name: '10万问题3',properties: { money: function(p) { return -p.money + 900000; }, time: 180 },
            from: '*',to: ''
        },

        {
            detail: [
                '你深深了解寂寞男女最需要的是什么，于是进货，开了一个淘宝店',
                '很努力的刷了一堆好评和成交量之后，你也开始赚钱了',
                '你很诧异的发现原来女性比男性更饥渴，至少从你店面情趣用品的数据上来看是这样',
                '你甚至怀疑专家说的中国未来将有三千万男光棍那些话',
                '你仿佛明白了一个道理：相信专家，还不如相信震动棒——虽然两者都会嗡嗡叫，但震动棒更有实质作用。',
            ],
            name: '10万问题4',properties: { money: function(p) { return -p.money + 800000; }, time: 60 },
            from: '*',to: ''
        },

        {
            detail: [
                '你怀着成为股神巴菲特的梦想，把资金都砸进了股市',
                '然后遇上了股市大跌…',
                '一个月之后，一位老朋友来找你借钱…',
                '“亲，最近手头急，能借点钱么？”',
                '“买股票了。”',
                '“算了，还是我借你点儿吧…”',
                '你泪盈满眶，联想起六爷借钱的那个场面，仿佛你就是六爷那位生活拮据的朋友，没钱借给六爷，还被六爷救助了…',
                '然而，借来的几百块钱，也只是够吃几顿饭，你又回到了最初那人来人往的大街，手里拿着1块钱…',
            ],
            name: '50万问题1',properties: { function(p) { return -p.money + 1; }, time: 1, __SHOW_ENDING: 1, ending: 40 },
            from: '*',to: ''
        },

        {
            detail: [
                '你干起了包工头生意，凭着你的三寸不烂之舌到处揽工程项目',
                '终于包下了几个大项目，你招来一群农民工兄弟，轰轰烈烈的当起了城市蓝图的建设者',
                '不做不知道，原来一直被你视为弱势群体的农民工兄弟，月薪竟都是上万的…',
                '还好工程款都能顺利收回，你还是狠狠的捞了一大笔钱',
            ],
            name: '50万问题2',properties: { money: 1500000, time: 360 },
            from: '*',to: ''
        },

        {
            detail: [
                '你联系上一群国外的走私团伙，开始进货高价的名包名表',
                '幸运的是，海关并没有扣下你的这批货。比国内低很多的价格，让你的这些名包名表总能很迅速的卖光',
                '只是你始终想不明白，为何这些“MADE IN CHINA”的东西环球旅行了一大圈，还是比国内专柜卖的要便宜一半',
                '你的走私生意做得红红火火，但考虑海关的风险，你知道这并不是长久之计',
            ],
            name: '50万问题3',properties: { money: 1500000,time: 180 },
            from: '*',to: ''
        },

        {
            detail: [
                '你在几十平米的屋子里面开始了你给员工的洗脑传销之路',
                '你在台上讲得如火如荼，台下员工听得如痴如醉，时不时的掌声轰鸣和口号，让你觉得你不去参加美国总统选举都可惜了',
                '你冷静的思考了一下，参选美国总统是花钱的事儿，你还是需要先挣钱，于是你打消了这个念头',
                '幸好打击传销这种事还没落到你头上，你的生意暂时平安无事',
                '拥有着一群死忠“合伙人”，你的传销之路越走越宽，当然，最重要的是，你真的捞了不少钱',
            ],
            name: '50万问题4',properties: { money: 1000000, time: 90 },
            from: '*',to: ''
        },

        {
            detail: [
                '铤而走险的你，人肉带回一大批海洛因',
                '“幸亏安检并没有检出来。”你看着这些售价接近黄金的毒品，倒吸一口冷气',
                '你深知毒品是祸害人类的东西，但幸好你没有亲眼目睹这些',
                '你只是做了一个毒枭小头目，卖货的事情你并没有直接参与',
                '其实，你最希望自己能像《绝命毒师》的老白那样，自己生产毒品，这样你就不用冒生命危险去缅甸进货了',
                '尽管如此，你的运气和老白一样好，赚到了钱，人还活着',
            ],
            name: '200万问题1',properties: { money: 8000000,time: 30,__SHOW_ENDING: 1,ending: 50 },
            from: '*',to: ''
        },

        {
            detail: [
                '通过技术外包，你的互联网P2P平台上线了',
                '你吸取学习了跑路的前辈的经验，深知这条线一定要放的够长，于是花了些钱在狼爪搜索和电梯媒体投了广告，也算吹的有名气了',
                '终于过了很长一段时间，你的P2P平台用户变得越来越多，里面的资金也有个上千万了',
                '你觉得是时候了，于是迅速关了了公司，卷了钱就开始跑路之旅',
                '你发现，P2P跑路的几千位同志里面，你只是一个特别小的小角色，网上甚至连骂你的帖子都沉的跟铅块一样，更不用说公安的案底了…',
            ],
            name: '200万问题2',properties: { money: 8000000,time: 90, __SHOW_ENDING: 1,ending: 50 },
            from: '*',to: ''
        },

        {
            detail: [
                '你找到了主播经纪人，谈好了价钱，很快就拉来一群漂亮的女主播',
                '在一个个十几平米的隔板间里，你给主播们传授了让看客乖乖花钱的武林秘籍',
                '各种小广告的投放迅速带来了一大批用户，你看着一个个香艳的主播工作室，暗暗的欣慰',
                '“这都是钱呐！”',
                '你终于明白，情色产业是推动世界经济的重要发展要素，这句话果然没错',
            ],
            name: '200万问题3',properties: { money: 2000000,time: 30, __SHOW_ENDING: 1,ending: 50},
            from: '*',to: ''
        },

        {
            detail: [
                '谈好了国内的货源和运输问题，你踏上了开拓非洲的道路',
                '你坚信你可以成为下一个把鞋子卖给非洲人的商人，凭借着你的拖拉机',
                '从供货到物流到质保，你都向非洲农场拍起胸脯说绝对没问题',
                '并且，冠以促进中非农业交流和出国体验游玩的名义，你还免费从蓝翔技校挖来两个拖拉机专业的工程师帮助你的客户干活',
                '非洲老黑对你的带动世界农业发展行为很是满意，高高兴兴的给了你一大笔钱',
            ],
            name: '200万问题4',properties: { money: 10000000,time: 360, __SHOW_ENDING: 1, ending: 50},
            from: '*', to: ''
        }
    ];

    public static STATES = {
        name: "一块钱起步",
        displayName: "一块钱起步",
        properties: {},
        questions: Yikuaiqian.QUESTIONS
    }


}
